START_BOT = '''
Вас приветствует самый креативный бот 💥<b>IMGAi</b>💥👋
Я умею генерировать изображения по тексту ✨✨✨
Чтобы опробовать меня, необходимо <b>зарегестрироваться</b>®️
Не пугайся, это очень просто, кликай на ➡️ <b>/register</b>
И следуй инструкциям 📝
'''

REGISTER_BOT = '''
<b>Введите своё имя</b>⬇️
'''

IS_ADD_BD = '''
<b>Вы уже зарегистрированы!</b>💥
'''

TRUE_REGISTER_USER = '''
<b>Поздравляем с успешной регистрацией</b>🎆
'''

GENERATE_BOT = '''
<b>Что хотите сгенерировать?</b>☺️
(Пример: <em>Котик на мотоцикле</em>)
'''

DELAY_GEN_IMAGE = '''
Ожидайте...⏳
'''

FILE_NAME_BOT = '''
<b>Введите имя файла
для сохранения сгенерированного фото</b>⬇️
(Пример: <em>myFile.png</em>)
'''

ERROR_CORRECT_FILE = '''
<b>ИМЯ ФАЙЛА НЕКОРРЕКТНО</b>❌
(Пример: <em>myFile<b>.png</b></em>)
'''

ERROR_NAME_FILE = '''
<b>Файл с таким названием уже есть, попробуйте другое имя</b>🫢
'''

SUSCESS_SAVE = '''
<b>Фото успешно сохранено</b>🌅
'''

CANCEL_IMAGE_BOT = '''
<b>Давай создадим шедевр!</b>🔥
'''

KANDIN_ERROR = '''
<b>К сожалению, сервис не доступен</b>😖
<b>Попробуйте позже</b>🤗
'''

SET_STYLE = '''
<b>Выберите понравившейся вам стиль генерации фото</b>⬆️
'''

STYLE_SUSSCES = '''
<b>Успешно!</b>✅
'''

SET_NEGATIVE = '''
<b>Установите то, что нежелаете </b>
'''

WELCOME_SETTINGS = '''
<b>Настройка параметров генерации изображения</b>📋
<em>Выберите один из предложенных вариантов</em>⬇️
'''

NEGATIVE_PROMPT = '''
<b>Вы можете прописать, какие цвета и приёмы модель не должна использовать при генерации изображения</b>⛔️
(Пример: <em>яркие цвета, кислотность, высокая контрастность</em>)
<b>Если хотите убрать текущий негативный промт, напишите ➡️ <em>Нет</em></b>
'''

SET_SIZE = '''
<b>Выберите формат изображения</b>🤔
'''

NAME_FILE_SHOWN = '''
<b>Введите имя файла изображения,
который хотите открыть</b>🖼
(Пример: <em>"myFile.png"</em>)
'''

OTHER_IMAGE = '''
<b>Выберите другое изображение или нажмите
<u>"Отмена"</u> для выхода</b>🔢
'''

ENDING_IMAGE_LIKE = '''
<b>Вы долистали до конца</b>🛑
'''

DONT_LIKE = '''
<b>Вы уже оценили данное изображение</b>👍
'''

PLACE_IMG = '''
<b>Какое место хотите увидеть?</b>🎲
'''

ERROR_MESSAGE = '''
<b>Опишите, при каких обстоятельствах произошла ошибка</b>✏️
'''

ANSWER_ABOUT_ERROR = '''
<b>Спасибо за обратную связь!</b>📞
'''

INFO_BOT = '''
Бот генерирует изображения благодаря нейросети <b>Kandinsky</b>✨
<b>Функционал бота:</b>
<em>➖Генерация изображений по запросу пользователей;</em>🖼
<em>➖Настройка конфигурации генерации изображений;</em>⚙️
<em>➖Просмотр сгенерированных изображений с возможностью сохранения;</em>👀
<em>➖Оценка изображений пользователей другими пользователями;</em>👍
<em>➖Таблица рейтинга сгенерированных изображений;</em>🥇
<b>Разработчик👨‍💻: ®️<em>@electr0dus</em></b>
<em>version:</em> <b>0.1</b>🛠
'''