START_BOT = '''
Вас приветствует самый креативный бот 💥<b>IMGAi</b>💥👋
Я умею генерировать изображения по тексту ✨✨✨
Чтобы опробовать меня, необходимо <b>зарегестрироваться</b>®️
Не пугайся, это очень просто, кликай на ➡️ <b>/register</b>
И следуй инструкциям 📝
'''

REGISTER_BOT = '''
<b>Введите своё имя</b>⬇️
'''

IS_ADD_BD = '''
<b>Вы уже зарегистрированы!</b>💥
'''

TRUE_REGISTER_USER = '''
<b>Поздравляем с успешной регистрацией</b>🎆
'''

GENERATE_BOT = '''
<b>Что хотите сгенерировать?</b>☺️
(Пример: <em>Котик на мотоцикле</em>)
'''

DELAY_GEN_IMAGE = '''
Ожидайте...⏳
'''